/**
 * @license
 * Copyright (c) 2016 The Polymer Project Authors. All rights reserved.
 * This code may only be used under the BSD style license found at http://polymer.github.io/LICENSE.txt
 * The complete set of authors may be found at http://polymer.github.io/AUTHORS.txt
 * The complete set of contributors may be found at http://polymer.github.io/CONTRIBUTORS.txt
 * Code distributed by Google as part of the polymer project is also
 * subject to an additional IP rights grant found at http://polymer.github.io/PATENTS.txt
 */

import { PolymerElement, html } from '@polymer/polymer/polymer-element.js';
import './shared-styles.js'
import '@cute/cute-card/cute-card'

class Arzesh extends PolymerElement {
  static get template() {
    return html`
      <style include="shared-styles">
        :host {
          display: block;
        }
        
        *{
          
          font-family: 'El Messiri';
        }
        cute-card{
          width:90%;
          margin:25px 5%;
          display:inline-block;
        }
        img {
          width:100%;
          object-fit:cover;
          box-shadow:0 0 10px #333;
        }
        .card-action{
          text-align:right;
        }
        .head{
          width:100%;
        }
        .con{
          width:100%;
          font-family: 'El Messiri';
        }
        #content{
          
          font-family: 'El Messiri';
        }
        #content img{
          max-width:98%;
        }
      a{
        text-decoration: none;
        color:#444;
      }
        .load{
          height:200px;
          padding:0
        }
        
      paper-spinner {
        display:block;
        margin: 20vh auto;
      }
        @media(min-width:700px){
          cute-card{
            width:90%;
            margin:25px calc(10%/2);
          }
          .load{
            display:inline-block;
            height:200px;
            width:30%;
            margin:25px calc(10%/7);
            padding:0
          }
        }
      </style>
      
      <div class="head">
      <img src="images/arzesh.jpg" /></div>
      <div class="con">
      <cute-card animated>
        <div class="card-content">

        <h1>تفکر ارزشی</h1>
        <p>تفکر ارزشی چیست؟ 
        <br />
        وقتی در انفاس صحبت از تفکر ارزشی می کنیم منظور ما دقیقا یک مدل تصمیم گیری است که توسعه دهندگان آن نامش را "تفکر ارزشی" نامیده اند. این مدل تصمیم گیری اولین بار بوسیله پرفسور رالف کینی در کتابی با عنوان "تفکر ارزشی راهی بسوی تصمیم گیری خلاق" معرفی شد. ما هم در انفاس با مبنا قرار دادن این کتاب ارزشمند و استفاده از سایر منابع خصوصا در زمینه تفکر استراتژیک کارگاه هایی را با عنوان "مهارت تصمیم گیری خلاق" طراحی کرده ایم، تفکر ارزشی و تفکر استراتژیک همانطور که آقای کینی در کتابش به آن اشاره کرده رابطه بسیار تنگاتنگی دارند و گاهی اوقات نمی توان آن ها را از هم تمییز داد و چه بسا نیازی هم به اینکار نیست بلکه ما در پی استفاده از نتایج کاربردی این علوم هستیم و در اینجا اینکه نام ها چه باشند اهمیت چندانی نخواهد داشت. شرکت کنندگان در این کارگاه ها با دریافت مثال های ساده و کاربردی با مفاهیم عمیق این شیوه تصمیم گیری آشنا شده و می توانند بسرعت این شیوه موثر و کارآمد را در عمل برای تصمیم گیری و تصمیم سازی در کار و زندگی استفاده کنند. </p>
        <p>
        پرفسور رالف ال. کيني  Ralph L. Keeney دانش‌آموخته موسسه فنآوری ماساچوست MIT و داراي مدرک دکترا در رشته تحقيق درعمليات، مبدع و نظریه پرداز تفکر ارزشی است. دکتر کيني از پژوهشگران برجسته‌اي است که مطالعات گسترده‌اي در زمينه تحليل تصميم،‌ تحليل ريسک و تصميم‌گيري چندهدفي انجام داده است. وی نخستین بار در اواخر دهه ۱۹۸۰ با چاپ  مقاله‌ای اولین گام‌ها را برای نظریه‌پردازی درباره تفکر ارزشی برداشت و نهایتا در اوائل دهه ۱۹۹۰ با انتشار کتاب "تفکر ارزشی: راهی به سوی تصمیم گیری خلاق" به طور کامل و مفصل این رویکرد را تئوریزه کرد. کتاب مذکور از مهم ترين آثار رالف کینی است که در سال ۱۹۹۴ جايزه کتاب سال آمريکا در زمينه تحليل تصميم را به خود اختصاص داد. جدای از اینکه امروزه سازمان‌های متعددی اعم از دولتی و خصوصی در تصمیم گیری‌ها و تصمیم سازی‌های خود از تفکر ارزشی استفاده می کنند نکته مهم این است که بدانید تفکر ارزشی چیز جدیدی نیست و افراد و شخصیت های زیادی در طول تاریخ بشریت از این شیوه تصمیم گیری استفاده کرده اند. بخصوص کسانی که رهبری فکری بشر را در دست گرفته و تاثیراتی چه مثبت و چه منفی بر مسیر تاریخ بر جای گذاشته اند. تفکر ارزشی مثل هر ابزار دیگری این قابلیت را دارد که در جهت مثبت یا خیر و یا در جهت منفی یا شر مورد استفاده قرار بگیرد! 
        </p>
        <p>
        داستان نوشتن این کتاب از این قرار است که در اوایل دهه 90 میلادی مدیران نیروی هوایی آمریکا قصد تدوین چشم انداز و استراتژی سال 2015 صنعت هوافضای آمریکا را داشتند و برای انجام این مهم نیاز به یک مدل تصمیم گیری عالی که قادر به تولید ایده های خلاقانه برای آینده نیز باشد بشدت احساس می شد. آن ها برترین دانشمندان و متخصصین حوزه تصمیم گیری را برای همکاری و یافتن بهترین مدل تصمیم گیری دعوت می کنند. حاصل پژوهش و همفکری این دانشمندان برجسته یک مدل تصمیم گیری بود. پرفسور رالف کینی که خودش هم از متخصصین ناسا است این مدل تصمیم گیری را "تفکر ارزشی" نامید  و پس از تئوریزه کردن کامل این روش، آن را در کتابی با همین نام (Value Focused Thinking) در سال 1992منتشر کرد. 
        تفکر ارزشی در مقابل تفکر گزینه ای! 
        تفکر ارزشی شیوه تصمیم گیری و تصمیم سازی مطلوب ماست که قصد ترویج آن را در بین مخاطبین خود و عموم جامعه داریم و آن هم شروع کردن با در اولویت قرار دادن ارزش ها است. اما تفکر گزینه ای شیوه تصمیم گیری است که کاملا در مقابل تفکر ارزشی است و آن هم شروع کردن با گزینه های در دسترس است و این چیزی است که ما قصد اجتناب از آن را داریم و در کارگاه های تصمیم گیری خلاق هم با ارائه نمونه ها و مثال های ساده به مخاطبین نشان می دهیم که چگونه این شیوه واپسگرا موجب اشتباهات استراتژیک در تصمیم گیری های بلندمدت و کوتاه مدت و حتی لحظه ای ما می شود. ویژگی اصلی چنین تفکری برخورد منفعلانه و غیر پیش دستانه، عدم کنترل بر موقعیت تصمیم، و از همه مهم‌تر سرکوب خلاقیت و نوآوری است و متاسفانه این شیوه رایج تصمیم گیری در بین اکثریت مردم است. 
        بکارگیری تفکر ارزشی نه تنها موجب تصمیم گیری و تصمیم سازی خلاقانه می شود بلکه مزایایی نظیر: ثبات قدم و تصمیم های یکپارچه، اعتماد بنفس، جراتمندی، بهبود ارتباطات، هدایت تفکر استراتژیک، تسهیل تصمیم های مشارکتی، آشکار شدن اهداف پنهان و ... را برای استفاده کننده در پی خواهد داشت. کسانی که این شیوه تصمیم گیری را در ذهن خود پیاده سازی کرده اند اذعان دارند که استفاده از آن نقطه عطف زندگی آن ها بوده است.
        </p>
        </div>
      </cute-card>
      </div>

      <div style="position:fixed; right:13px; bottom:13px;">
        <a href="maharat">
          <paper-button style="background-color:#EEE; box-shadow:0 0 13px #444">بعدی</paper-button>
        </a>
      </div>

    `;
  }

}

window.customElements.define('arzesh-page', Arzesh);
